{
    "en": {
        "header": {
            "home": "Home",
            "resume": "CV",
            "projects": "Projects",
            "hobbies": "Hobbies",
            "explore": "Explore"
        },
        "home": {
            "welcome": "Welcome to my personal portfolio",
            "job": "Software Developer",
            "welcome": "Welcome to my personal portfolio",
            "created": "This Page was created all by myself",
            "resume": "Resume",
            "check-out": "Check out my Projects",
            "version-control": "Version Control",
            "other": "Other",
            "projects-h": "Take a look at what I've been building",
            "projects-p": "I created a live demo for some of my projects.  Projects that use a backend can currently only be shown with screenshots because the website is still hosted without backend.",
            "projects-prox": "Streamlined interface for interacting with the Proxmox API using Angular and Go.",
            "projects-nasa": "Lightweight frontend for presenting selected NASA data retrieved from their public API",
            "hobbies-h": "Yes, I do leave my keyboard sometimes",
            "hobbies-p": "When I'm not staring at error messages, I'm staring at stars",
            "hobbies-button": "My Hobbies"
        },
        "resume": {
            "resume-contact": "Contact",
            "resume-language": "Language Skills",
            "resume-language-de": "German",
            "resume-language-de-skill": "Native Language",
            "resume-language-en": "English",
            "resume-language-en-skill": "B1 (Intermediate)",
            "resume-head": "Curriculum Vitae",
            "resume-topic": "Topics:",
            "resume-apprentice": "Apprenticeship as Software Developer",
            "resume-topic-basics": "Basic Programming",
            "resume-topic-databases": "Databases",
            "resume-topic-webdev": "Webdevelopment",
            "resume-topic-project": "Project Management",
            "resume-topic-test": "Testing",
            "resume-abi": "Higher Vocational School for Business and Administration, focus on Business Informatics",
            "resume-topic-admin": "Business Administration",
            "resume-topic-eco": "Economics",
            "resume-topic-acc": "Accounting",
            "resume-topic-info": "Business Informatics",
            "resume-logistics": "Warehouse Logistics Specialist",
            "resume-topics-inventory": "Inventory Control",
            "resume-topics-storage": "Storage of Goods",
            "resume-topics-goods": "Goods Receipt",
            "resume-topics-order": "Order Picking & Packaging",
            "resume-apprenticeship": "Apprenticeship"
        },
        "projects": {
            "projects-head": "My Projects",
            "projects-p": "Try some of my html-based projects in a simulation, or scroll down to see some more advanced projects. Some Projects might not work correctly as demo.",
            "projects-select": "Choose a project",
            "projects-nasa-p": "At some point, I realized that NASA offers a free API that provides access to a wide range of fascinating astronomical data. From images of distant galaxies to real-time information about near-Earth objects, the API opens the door to exploring space in a completely new way. Its an inspiring resource for developers, hobby astronomers, or anyone curious about the universe.",
            "projects-todo-p": "One of my first projects. Nothing special, but good to learn some basics — a simple to-do list made mainly for practice and getting familiar with the fundamentals.",
            "projects-prox-p": "The Proxmox Custom Interface is a lightweight management tool that makes it easy to control virtual machines, manage users, and assign VMs to specific people. I created this project for a friends private use so he and his friends can manage their VMs together in a simple and convenient way.",
            "projects-prox-p2": "Go powers the communication with the Proxmox API, ensuring fast and reliable data processing for the backend. The frontend is built with Angular, providing a modern, responsive, and seamless user experience."
        },
        "hobbies": {
            "astro-head": "Astronomy",
            "astro-p": "The infinite vastness of the universe holds countless wonders waiting to be disovered.",
            "astro-p2": "Astronomy is a fascinating hobby, especially because you can observe the planets of our solar system with your own eyes through a telescope. This direct view of distant worlds makes stargazing truly exciting. Every clear night brings new discoveries, from nearby planets to distant galaxies, blending science with wonder and curiosity.",
            "gaming-head": "Gaming (for sure)",
            "gaming-p": "Gaming has long become socially accepted and is now widely recognized as a legitimate hobby. Beyond entertainment, it offers creativity, strategy, and social interaction. Just like in real life, exploring new worlds in games is especially exciting. Discovering unknown places, stories, and experiences makes gaming so engaging.",
            "games-list": "My favorite Games",
            "hiking-head": "Hiking is fun... mostly",
            "hiking-p": "Hiking is a hobby I really enjoy, even though Im not the most athletic person. Being out in nature, away from screens and daily routines, feels refreshing. I like exploring new places, enjoying the scenery, and discovering the world step by step at my own pace."
        }
    },
    "de": {
        "header": {
            "home": "Startseite",
            "resume": "Lebenslauf",
            "projects": "Projekte",
            "hobbies": "Hobbys",
            "other": "Other",
            "explore": "Erkunden"
        },
        "home": {
            "welcome": "Wilkommen zu meinem persönlichem Portfolio",
            "job": "Softwareentwickler",
            "welcome": "Wilkommen zu meinem persönlichen Portfolio",
            "created": "Diese Webseite wurde vollständig von mir entwickelt",
            "resume": "Lebenslauf",
            "check-out": "Meine Projekte",
            "version-control": "Versionsverwaltung",
            "other": "Weiteres",
            "projects-h": "Schau dir meine Projekte an",
            "projects-p": "Für einige Projekte steht eine Live-Demo zur Verfügung. Anwendungen mit Backend können derzeit nur über Screenshots präsentiert werden, da die Seite aktuell ohne Backend gehostet wird.",
            "projects-prox": "Eine optimierte Schnittstelle für die Interaktion mit der Proxmox-API unter Verwendung von Angular und Go",
            "projects-nasa": "Ein leichtgewichtiges Frontend zur Darstellung ausgewählter NASA-Daten aus ihrer öffentlichen API",
            "hobbies-h": "Ja, manchmal lasse ich meine Tastatur auch in Ruhe",
            "hobbies-p": "Wenn ich gerade mal nicht auf Errormessages schaue, schaue ich vermutlich in die Sterne",
            "hobbies-button": "Meine Hobbys"
        },
        "resume": {
            "resume-contact": "Kontakt",
            "resume-language": "Sprachkenntnisse",
            "resume-language-de": "Deutsch",
            "resume-language-de-skill": "Muttersprache",
            "resume-language-en": "Englisch",
            "resume-language-en-skill": "B1 (Fortgeschrittene Grundkenntnisse)",
            "resume-head": "Lebenslauf",
            "resume-topic": "Themen:",
            "resume-apprentice": "Ausbildung zum Fachinformatiker für Anwendungsentwicklung",
            "resume-topic-basics": "Grundlagen der Programmierung",
            "resume-topic-databases": "Datenbanken",
            "resume-topic-webdev": "Webentwicklung",
            "resume-topic-project": "Projektmanagement",
            "resume-topic-test": "Unit-Tests",
            "resume-abi": "Höhere Berufsfachschule für Wirtschaft und Verwaltung",
            "resume-topic-admin": "Betriebswirtschaft",
            "resume-topic-eco": "Volkswirtschaftslehre",
            "resume-topic-acc": "Rechnungswesen",
            "resume-topic-info": "Wirtschaftsinformatik",
            "resume-logistics": "Fachkraft für Lagerlogistik",
            "resume-topics-inventory": "Bestandskontrolle",
            "resume-topics-storage": "Einlagerung von Waren",
            "resume-topics-goods": "Warenannahme",
            "resume-topics-order": "Kommissionierung & Verpackung",
            "resume-apprenticeship": "Ausbildung"
        },
        "projects": {
            "projects-head": "My Projects",
            "projects-p": "Probiere einige meiner HTML-basierten Projekte in einer Simulation aus oder scrolle nach unten, um anspruchsvollere Projekte zu sehen. Einige Projekte funktionieren eventuell nicht vollständig in der Demo.",
            "projects-select": "Choose a project",
            "projects-nasa-p": "Die NASA bietet tatsächlich eine kostenlose API an, die Zugriff auf eine Vielzahl faszinierender astronomischer Daten ermöglicht. Von Bildern weit entfernter Galaxien bis hin zu Echtzeitinformationen über erdnahe Objekte eröffnet diese API ganz neue Möglichkeiten, den Weltraum zu erkunden. Sie ist eine inspirierende Ressource für Entwickler, Hobbyastronomen und alle, die neugierig auf das Universum sind.",
            "projects-todo-p": "Eines meiner ersten Projekte. Nichts Besonderes, aber gut geeignet, um ein paar Grundlagen zu lernen - eine einfache To-do-Liste, hauptsächlich zu Übungszwecken.",
            "projects-prox-p": "Das Proxmox Custom Interface ist ein leichtgewichtiges Verwaltungstool, mit dem sich virtuelle Maschinen einfach steuern, Benutzer verwalten und VMs bestimmten Personen zuweisen lassen. Ich habe dieses Projekt für den privaten Einsatz eines Freundes entwickelt, damit er und seine Freunde ihre VMs gemeinsam auf einfache und komfortable Weise verwalten können.",
            "projects-prox-p2": "Go übernimmt die Kommunikation mit der Proxmox-API und sorgt dabei für eine schnelle und zuverlässige Datenverarbeitung im Backend. Das Frontend wurde mit Angular umgesetzt und bietet eine moderne, responsive und nahtlose Benutzeroberfläche."
        },
        "hobbies": {
            "astro-head": "Astronomie",
            "astro-p": "Die unendliche Weite des Universums birgt unzählige Wunder, die darauf warten, entdeckt zu werden.",
            "astro-p2": "Astronomie ist ein faszinierendes Hobby, vor allem weil man die Planeten unseres Sonnensystems mit eigenen Augen durch ein Teleskop beobachten kann. Dieser direkte Blick auf ferne Welten macht die Himmelsbeobachtung besonders spannend. Jede klare Nacht bringt neue Entdeckungen - von nahen Planeten bis hin zu fernen Galaxien - und verbindet Wissenschaft mit Staunen und Neugier.",
            "gaming-head": "Gaming (natürlich)",
            "gaming-p": "Ich hoffe, Gaming ist mittlerweile so weit in der Gesellschaft angekommen, dass man es problemlos als Hobby aufzählen kann. Über reine Unterhaltung hinaus bietet es Kreativität, Strategie und sozialen Austausch. Genau wie im echten Leben ist es besonders spannend, in Spielen neue Welten zu erkunden, unbekannte Orte zu entdecken und in neue Geschichten und Erlebnisse einzutauchen.",
            "games-list": "Meine Lieblingsspiele",
            "hiking-head": "Wandern macht spaß... meistens",
            "hiking-p": "Wandern ist ein Hobby, das ich sehr gerne ausübe, auch wenn ich nicht der sportlichste Mensch bin. Draußen in der Natur zu sein, fernab von Bildschirmen und dem Alltag, fühlt sich erfrischend an. Ich genieße es, neue Orte zu entdecken, die Landschaft zu erleben und die Welt Schritt für Schritt in meinem eigenen Tempo zu erkunden."
        }
    }
}